# 5.1 pandas的数据结构介绍

In [1]:
# pandas 专门为处理【表格】和【混杂数据】设计的
# NumPy 更适合处理统一的数值数组数据

# 介绍pandas的两种主要数据结构：Series和DataFrame

## 5.1.1 Series

In [7]:
# Series 是一种类似于一维数组的对象，它由一组数据（各种 NumPy 数据类型）以及一组与之相关的数据标签（即索引）组成

import pandas as pd

In [8]:
obj = pd.Series([4, 7, -5, 3])

In [9]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [11]:
# 可以通过 Series 的 values 和 index 属性获取其数组表示形式和索引对象

obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [13]:
# 自定义【索引】形式

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [14]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
# 可通过索引的方式选取Series中的单个或一组值

obj2['a']

-5

In [15]:
obj2['d'] = 6 # 赋值

In [16]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [17]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [18]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [19]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np

np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
# 可将Series看成是一个定长的有序字典，因为它是索引值到数据值的一个映射。

'b' in obj2

True

In [22]:
'e' in obj2

False

In [23]:
# 如果数据被不许在一个python字典中，也可以直接通过这个字典来创建Series
# 如果只传入一个字典，则结果Series中的索引就是原字典的键

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = pd.Series(sdata)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
# 可以传入排好序的字典的键以改变顺序

states = ['California', 'Ohio', 'Oregon', 'Texas']

In [31]:
# 由于 "California" 所对应的 sdata 值找不到，所以其结果为 NaN
# 在 pandas 中，NaN 用于表示缺失或 NA
# 因为 "Utah" 不在 states 中，它被从结果中除去

obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
# pandas的isnull和notnull函数可用于检测缺失数据

pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [34]:
# Series的类似实例方法

obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
# Series最重要的一个功能：它会根据运算的索引标签自动对齐数据,即数据对齐

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
# Series对象本身及其索引的name属性

obj4.name = 'population'

In [40]:
obj4.index.name = 'state'

In [41]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [42]:
# Series的索引可以通过赋值的方式就地修改

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [43]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [44]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## 5.1.2 DataFrame

In [45]:
import pandas as pd
import numpy as np

In [48]:
# 创建DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [49]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
# head方法：选取前5行

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [51]:
# 指定列序列

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [52]:
# 如果传入的列在数据中找不到，则结果中产生缺失值

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])

In [53]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [54]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [56]:
# 通过字典标记、属性的方式，可以将DataFrame的列获取为一个Series

frame2['state']  # 适用于任何列的名

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [58]:
frame2.year  # 只有在列名是一个合理的 Python 变量名时才适用

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [59]:
# 获取【行】的内容

frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [60]:
# 【列】可以通过【赋值】的方式【修改】

frame2['debt'] = 16.5

In [61]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [62]:
frame2['debt'] = np.arange(6.)

In [63]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [64]:
# 通过Series赋值，精确匹配，所有空位都被填上缺失值

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [65]:
frame2['debt'] = val

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [69]:
# 为不存在的列赋值会创建出新列
# del用于删除列
# 不能用 frame2.eastern 创建新的列

frame2['eastern'] = frame2.state == 'Ohio'

In [70]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [71]:
# 用del方法删除eastern列

del frame2['eastern']

In [72]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [75]:
# 嵌套字典： 外层字典的键为【列】，内层键则为【行】

pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [76]:
# 嵌套字典传给DataFrame

frame3 = pd.DataFrame(pop)

In [77]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [79]:
# 对DataFrame进行【转置】：交换行和列

frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [81]:
# 内层字典的键会被合并、排序以形成最终的索引
# 如果明确指定了索引，则不会这样

pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [82]:
# 由 Series 组成的字典差不多也是一样的用法

pdata = {'Ohio': frame3['Ohio'][ : -1],
         'Nevada': frame3['Nevada'][ : 2]}

In [83]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [85]:
%%html
<img src="picture/表5-1 可以输入给DataFrame构造器的数据.png", width = 500>

In [91]:
# idnex、columns的name属性
# frame3.name = 'population'  #在DataFrame中无效。只在Series中生效？

frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [92]:
# values属性：以二维ndarray的形式返回DataFrame中的数据

frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [93]:
# 如果DataFrame各列的数据类型不同，则值数组的dtype就会选用能兼容所有列的数据类型

frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

## 5.1.3 索引对象

In [50]:
import pandas as pd

In [94]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [95]:
index = obj.index

In [96]:
index

Index(['a', 'b', 'c'], dtype='object')

In [97]:
index[1: ]

Index(['b', 'c'], dtype='object')

In [98]:
# 不能对index对象进行修改

# index[1] = 'd'  # TypeError

In [101]:
# index的不可变，可以实现多个数据结构之间的安全共享
# index[1] = 'd'  # TypeError

labels = pd.Index(np.arange(3))

In [102]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [103]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [104]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [105]:
obj2.index is labels

True

In [106]:
# Index类似于一个固定大小的集合

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [107]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [108]:
'Ohio' in frame3.columns

True

In [110]:
2000 in frame3.index

True

In [111]:
# 与python的集合不同，pandas的Index可以包含重复的标签

dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [118]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [119]:
# 每个索引都有一些方法和属性，它们可用于设置逻辑并回答有关该索引包含的数据的常见问题

In [122]:
%%html
<img src="picture/表5-2 Index的方法和属性.jpg", width = 500>

# 5.2 基本功能

## 5.2.1 重新索引(reindex)

In [123]:
import pandas as pd

In [124]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [125]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [129]:
# 重新索引(reindex)
# reindex 将会根据新索引进行重排
# 如果某个索引值当前不存在，就会引入【缺失值】

obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [131]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [132]:
# method实现插值，ffill可实现前向值填充

obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [136]:
# 借助DataFrame, reindex可以修改（行）索引和列。
# 只传递一个序列时，会重新索引结果的行

import numpy as np

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [139]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [16]:
# 【列】可以用columns关键字重新索引

states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [140]:
%%html
<img src="picture/表5-3 reindex函数的参数.jpg", width = 500>

## 5.2.2 丢弃指定轴上的项

In [1]:
# drop方法，返回一个在指定轴上删除了指定值的新对象

import pandas as pd
import numpy as np
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [2]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [3]:
new_obj = obj.drop("c")

In [4]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [5]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [6]:
# 对于DataFrame，可以删除任意轴上的索引值。

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [7]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
# 用标签序列调用drop，会从行标签(axis 0)删除值

data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
# 通过传递 axis=1 or axis='columns' 可以删除【列】的值

data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [16]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [17]:
# 就地修改对象
# inplace会销毁所有被删除的数据

obj.drop('c', inplace=True)

In [18]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## 5.2.3 索引、选取和过滤

In [1]:
import numpy as np
import pandas as pd

In [8]:
# Series 索引(obj[...])的工作方式类似于 NumPy 数组的索引，只不过 Series 的索引值不只是整数

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [9]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [23]:
obj['b']

1.0

In [24]:
obj[2: 4]

c    2.0
d    3.0
dtype: float64

In [25]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [26]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [10]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [28]:
# 标签的切片运算，其末端是包含的

obj['b': 'c']

b    1.0
c    2.0
dtype: float64

In [29]:
# 用切片可以对Series的相应部分进行设置

obj['b': 'c'] = 5

In [30]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [11]:
# 用一个值或序列对 DataFrame 进行索引，其实就是获取一个或多个列。

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [12]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [17]:
data[ : 1]  # 选取【行】

      one  two  three  four
Ohio    0    1      2     3

In [18]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [36]:
# 几种特殊情况。
# 通过切片或布尔型数组选取数据

data[: 2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [41]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [19]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
# 通过布尔型 DataFrame 进行索引

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [22]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 5.2.4 用loc和iloc进行选取

In [30]:
# loc:  轴标签
# iloc: 整数索引

import numpy as np
import pandas as pd

In [24]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [25]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data[data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
# 通过标签选择一行或多列

data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [28]:
data.at['Utah', 'one']   # 选取单一标量

8

In [29]:
# 用iloc和整数进行选取

data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [53]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [54]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [55]:
# 这两个索引函数也适用于一个或多个标签的切片

data.loc[ : 'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [38]:
data.iloc[ : , : 3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [39]:
%%html

<img src="picture/表5-4.png",width = 500>

## 5.2.5 整数索引

In [40]:
import numpy as np
import pandas as pd

In [41]:
ser = pd.Series(np.arange(3.))

In [42]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [43]:
# ser[-1]
# 产生异常

In [44]:
# 对于非整数索引，不会产生歧义

ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [45]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [46]:
ser2[-1]

2.0

In [67]:
ser[ : 1]

0    0.0
dtype: float64

In [70]:
# loc 标签
ser.loc[ : 1]

0    0.0
1    1.0
dtype: float64

In [71]:
# iloc 整数
ser.iloc[ : 1]

0    0.0
dtype: float64


## 5.2.6 算术运算和数据对齐

In [47]:
import numpy as np
import pandas as pd

In [52]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [53]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], 
              index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [54]:
# 相加 

s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [55]:
# 对于DataFrame，【对齐操作】会同时发生在行和列上

df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [56]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [57]:
# 相加：返回一个新的DataFrame，其索引和列为原来那两个DataFrame的并集
# 因为'c'和'e'列均不在两个DataFrame对象中，在结果中以缺少值呈现。行也是同样。

df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
# 如果DataFrame对象相加，没有共用的列或行标签，结果都会是空

df3 = pd.DataFrame({'A': [1, 2]})
df3

   A
0  1
1  2

In [59]:
df4 = pd.DataFrame({'B': [3, 4]})
df4

   B
0  3
1  4

In [60]:
df3 - df4

    A   B
0 NaN NaN
1 NaN NaN

## 5.2.7 在算术方法中填充值(fill_value)

In [61]:
import numpy as np
import pandas as pd

In [62]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [63]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [66]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [67]:
# 相加 没有重叠的位置就会产生NA值

df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [68]:
# 使用df1的add方法，传入df2以及一个fill_value参数

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [69]:
# 以字母r开头，它会翻转参数

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [70]:
1 / df1 == df1.rdiv(1)

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

In [71]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [72]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [19]:
# 在对Series中DataFrame重新索引时，也可指定填充值

df1.reindex(columns=df2.columns, fill_value='异常')

     a    b     c     d   e
0  0.0  1.0   2.0   3.0  异常
1  4.0  5.0   6.0   7.0  异常
2  8.0  9.0  10.0  11.0  异常

In [73]:
%%html
<img src="picture/表5-5 灵活的算术方法.png">

## 5.2.8 DataFrame 和 Series 之间的运算

In [74]:
# 计算一个二维数组与其某行之差

arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [75]:
arr[0]

array([0., 1., 2., 3.])

In [76]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [77]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [84]:
frame.loc['Ohio']  # loc: 标签

b    3.0
d    4.0
e    5.0
Name: Ohio, dtype: float64

In [85]:
series = frame.iloc[1]  # iloc: 整数
series

b    3.0
d    4.0
e    5.0
Name: Ohio, dtype: float64

In [36]:
# 在默认情况下，DataFrame和Series之间的算术运算会将Series的索引匹配到DataFrame的列，然后沿着行一直向下广播

frame - series

          b    d    e
Utah   -3.0 -3.0 -3.0
Ohio    0.0  0.0  0.0
Texas   3.0  3.0  3.0
Oregon  6.0  6.0  6.0

In [86]:
# 如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集

series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [87]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [88]:
# 匹配行且在列上广播，则必须使用算术运算方法

series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [41]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [89]:
# axis='index' or axis=0

frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 5.2.9 函数应用和映射

In [90]:
import numpy as np
import pandas as pd

In [91]:
# Numpy的ufuncs(元素级数组方法)也可惜用于操作pandas对象

frame = pd.DataFrame(np.random.randn(4, 3),
                    columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.789429  1.362536  1.488039
Ohio    0.438899 -1.753489 -1.579579
Texas  -0.158205 -0.369209 -0.787940
Oregon -0.817898  0.557120  0.317358

In [92]:
np.abs(frame)

               b         d         e
Utah    1.789429  1.362536  1.488039
Ohio    0.438899  1.753489  1.579579
Texas   0.158205  0.369209  0.787940
Oregon  0.817898  0.557120  0.317358

In [93]:
# 将函数应用到由各列或行所形成的一维数组上
# DataFrame的apply方法

f = lambda x: x.max() - x.min()

In [94]:
# 默认以【列】作用索引
frame.apply(f)

b    2.607327
d    3.116025
e    3.067617
dtype: float64

In [95]:
# axis='columns' 在每【行】执行

frame.apply(f, axis='columns')

Utah      0.426893
Ohio      2.192388
Texas     0.629736
Oregon    1.375018
dtype: float64

In [96]:
# 传递到apply的函数还可以返回由多个值组成的Series

def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [97]:
frame.apply(f)

            b         d         e
min -0.817898 -1.753489 -1.579579
max  1.789429  1.362536  1.488039

In [98]:
# applymap：得到frame中各个浮点值的格式化字符串

fromat = lambda x: '%.2f' % x

In [99]:
frame.applymap(format)

                           b                    d                    e
Utah      1.7894290595348177      1.3625360312885   1.4880388913722924
Ohio      0.4388992629735139  -1.7534892065075736  -1.5795785837425034
Texas   -0.15820477829444207   -0.369209030597736  -0.7879404773592198
Oregon   -0.8178982866580976   0.5571199335196033   0.3173580068943925

In [100]:
# Series中有一个用于应用元素级函数的map方法

frame['e'].map(format)

Utah       1.4880388913722924
Ohio      -1.5795785837425034
Texas     -0.7879404773592198
Oregon     0.3173580068943925
Name: e, dtype: object

## 5.2.10 排序和排名

In [101]:
import numpy as np
import pandas as pd

In [103]:
# sort_index方法：返回一个已排序的新对象

obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [104]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [105]:
obj = pd.Series(range(5), index=list('ceadb'))
obj

c    0
e    1
a    2
d    3
b    4
dtype: int64

In [106]:
obj.sort_index()

a    2
b    4
c    0
d    3
e    1
dtype: int64

In [108]:
# 对于DataFrame，可根据任意一个轴的索引进行排序

frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index = ['three', 'one'],
                    columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [109]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [110]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [111]:
# 降序排列  ascending = False

frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [112]:
# 按【值】对Series进行排序  sort_values()

obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [113]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [114]:
# 缺失值默认排在Series的末尾

obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [115]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [116]:
# sort_values中的by选项，可以根据一个或多个列中的值进行排序

frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [118]:
# 根据 b 列进行排序

frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [119]:
# 根据多个列排序

frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [120]:
# rank(): 通过“为各组分配一个平均排名”的方式破坏平级关系

obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [121]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [122]:
obj.rank(method='dense')

0    5.0
1    1.0
2    5.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [123]:
# 根据在原数据中出现的顺序给出排名
# 这里条目0和2没有使用平均排名6.5，它们被设成了6和7，因为数据中标签0位于标签2的前面

obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [124]:
# 降序排列

obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [125]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [126]:
# DataFrame可以在行或列上计算排名

frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [127]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [128]:
frame.rank(axis='index')

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [129]:
%%html
<img src="picture/表5-6 排名时用于破坏平级关系的方法.png">

## 5.2.11 带有重复标签的轴索引

In [130]:
import numpy as np
import pandas as pd

In [131]:
# 简单的带有重复索引值的Series

obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [132]:
# is_unique: 判断值是否唯一

obj.index.is_unique

False

In [133]:
# 对应多个值：返回一个Series；对应单个值：返回一个标量值

obj['a']

a    0
a    1
dtype: int64

In [134]:
obj['c']

4

In [135]:
# 对DataFrame的【行】进行索引

df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.324521 -0.785384  1.452774
a  0.114201  0.694243 -1.030435
b  0.701443 -1.172321  0.306000
b  0.953200 -0.833511 -0.383106

In [136]:
df.loc['b']

          0         1         2
b  0.701443 -1.172321  0.306000
b  0.953200 -0.833511 -0.383106

# 5.3 汇总和计算描述统计

In [137]:
import numpy as np
import pandas as pd

In [138]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index = ['a', 'b', 'c', 'd'],
                 columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [139]:
# DataFrame.sum():返回一个含有列的和的Series

df.sum()

one    9.25
two   -5.80
dtype: float64

In [140]:
# axis='columns' or axis=1 按【行】求和

df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [141]:
# NA值会自动被排除，除非整个切片（这里指的是行或列）都是NA。
# skipna = False 选项可禁用该功能

df.sum(axis='columns', skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [142]:
# idxmin, idxmax or ect 返回间接统计（比如达到最小值或最大值的索引）

df.idxmax()

one    b
two    d
dtype: object

In [143]:
# 累计型方法

df.cumsum()  # 向下累加

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [144]:
# DataFrame.describe() 用于一次性产生多个汇总统计

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [145]:
# 非数值型数据——describe()会产生另外一种汇总统计

obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [146]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [148]:
%%html
<img src="picture/表5-8列出了所有与描述统计相关的方法.jpg", width=500>

## 5.3.1 相关系数与协方差

In [149]:
import numpy as np
import pandas as pd

In [151]:
import pandas_datareader.data as web

In [152]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [164]:
returns = price.pct_change()

In [165]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-05-06 -0.015443  0.000927 -0.005818  0.003366
2019-05-07 -0.026957 -0.019518 -0.020523 -0.012855
2019-05-08  0.000197  0.002616 -0.000080 -0.006669
2019-05-09 -0.010744 -0.007626 -0.000080 -0.003335
2019-05-10 -0.013853 -0.000148  0.012988  0.001626

In [166]:
# corr(相差系数): 计算两个Series中重叠的、非NA的、按索引对齐的值的相关系数
# cov(协方差)

returns['MSFT'].corr(returns['IBM'])

0.48565223570590677

In [156]:
returns['MSFT'].cov(returns['IBM'])

8.643135546794599e-05

In [157]:
# 简化

returns.MSFT.corr(returns.IBM)

0.48565223570590677

In [158]:
# DataFrame.corr()与DataFrame.cov():以DataFrame的形式分别返回完整的相关系数或协方差矩阵

returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.370686  0.448227  0.455828
IBM   0.370686  1.000000  0.485652  0.403451
MSFT  0.448227  0.485652  1.000000  0.534356
GOOG  0.455828  0.403451  0.534356  1.000000

In [159]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000269  0.000075  0.000106  0.000115
IBM   0.000075  0.000151  0.000086  0.000077
MSFT  0.000106  0.000086  0.000209  0.000119
GOOG  0.000115  0.000077  0.000119  0.000238

In [160]:
# DataFrame.corrwith(): 可以计算其列或行跟另一个Series或DataFrame之间的相关系数
# 传入一个Series，将会返回一个相关系数值Series(针对各列进行计算)
returns.corrwith(returns.IBM)

AAPL    0.370686
IBM     1.000000
MSFT    0.485652
GOOG    0.403451
dtype: float64

In [161]:
# 传入一个DataFrame，则会计算按列名配对的相关系数。
# 计算百分比变化与成交量的相关系数

returns.corrwith(volume)

AAPL   -0.060065
IBM    -0.155818
MSFT   -0.089679
GOOG   -0.020541
dtype: float64

In [16]:
# 传入axis='columns'即可按行进行计算

returns.corrwith(volume, axis='columns')

## 5.3.2 唯一值、值计数以及成员资格

In [167]:
import numpy as np
import pandas as pd

In [168]:
# 从一维Series的值中抽取信息

obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [169]:
# unique(): 可以得到Series中的唯一值数组

uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [170]:
# value_counts(): 用于计算一个Series中各值出现的频率

obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [171]:
# 不使用降序排列

pd.value_counts(obj.values, sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [172]:
# isin: 用于判断适量化集合的成员资格，可用于过滤Series中或DataFrame列中数据的子集

obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [173]:
mask = obj.isin(['b', 'c'])

In [174]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [175]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [176]:
# Index.get_indexer(): 与isin类似，可以给你一个索引数组，从可能包含重复值的数组到另一个不同值的数组

to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [177]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [178]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [180]:
# 得到DataFrame中多个相关列的一张柱状图

data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [181]:
# 将pandas.value_counts传给该DataFrame的apply函数

result = data.apply(pd.value_counts).fillna(0)

In [43]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [182]:
%%html
<img src="picture/表5-9 唯一值、值计数、成员资格方法.png">